Date: Mon, 28 Jun 1999 09:25:19 -0500
From: Mailing List Account <>
Subject: crond in 2.2.10ac4
Sender: linux-kernel-owner@vger.kernel.org
Precedence: bulk
List-ID: <linux-kernel.vger.kernel.org>
X-Mailing-List: linux-kernel@vger.kernel.org
X-Lkml-Link: https://lkml.org/lkml/1999/6/28/108

I am having problems getting crond to run correctly under a virtual server
(done with the virtual server HOW-TO as a guide) under 2.2.10ac4. It is
working fine under 2.0.36.
The crond in the main server is running fine, but the virtuals are failing
to STAT a file correctly. Following is a diff of the strace output from a
virtual (<<) and the main server (>>). It appears the value of st_mode is
getting set differently in the two environments. Why would that be
happening, and how can I correct it?
Note: crontrace is the virtual, maintrace is the main. Maintrace is the
working one, crontrace is the non-working one.
[root: /virtual/weather] # diff crontrace maintrace
5,6c5,6
< fstat(4, {st_mode=S_ISVTX|0327, st_size=0, ...}) = 0
< mmap(0, 8161, PROT_READ, MAP_PRIVATE, 4, 0) = 0x40014000
---
> fstat(4, {st_mode=031032, st_size=0, ...}) = 0
> mmap(0, 10786, PROT_READ, MAP_PRIVATE, 4, 0) = 0x40014000
11,14c11,14
< mmap(0, 974392, PROT_READ|PROT_EXEC, MAP_PRIVATE, 4, 0) = 0x40016000
< mprotect(0x400fc000, 32312, PROT_NONE)  = 0
< mmap(0x400fc000, 20480, PROT_READ|PROT_WRITE, MAP_PRIVATE|MAP_FIXED, 4,
0xe5000) = 0x400fc000
< mmap(0x40101000, 11832, PROT_READ|PROT_WRITE,
MAP_PRIVATE|MAP_FIXED|MAP_ANONYMOUS, -1, 0) = 0x40101000
---
> mmap(0, 974392, PROT_READ|PROT_EXEC, MAP_PRIVATE, 4, 0) = 0x40017000
> mprotect(0x400fd000, 32312, PROT_NONE)  = 0
> mmap(0x400fd000, 20480, PROT_READ|PROT_WRITE, MAP_PRIVATE|MAP_FIXED, 4,
0xe5000) = 0x400fd000
> mmap(0x40102000, 11832, PROT_READ|PROT_WRITE,
MAP_PRIVATE|MAP_FIXED|MAP_ANONYMOUS, -1, 0) = 0x40102000
16c16
< munmap(0x40014000, 8161)                = 0
---
> munmap(0x40014000, 10786)               = 0
18c18
< getpid()                                = 18663
---
> getpid()                                = 18672
26c26
< fstat(4, {st_mode=S_ISVTX|0325, st_size=0, ...}) = 0
---
> fstat(4, {st_mode=0, st_size=0, ...})   = 0
32,33c32,33
< getpid()                                = 18663
< write(4, "18663\n", 6)                  = 6
---
> getpid()                                = 18672
> write(4, "18672\n", 6)                  = 6
39,40c39,40
< stat("cron", {st_mode=S_ISVTX|0264, st_size=0, ...}) = 0
< fork()                                  = 18664
---
> stat("cron", {st_mode=031366, st_size=0, ...}) = 0
> fork()                                  = 18673
Best,
Scott Temaat, CEO
SOHOWeb Technologies, LLC (
http://sohoweb.net
)
Effective Web Presence Doesn't Cost -- IT PAYS
Toll-Free: 888-421-SOHO
-
To unsubscribe from this list: send the line "unsubscribe linux-kernel" in
the body of a message to majordomo@vger.rutgers.edu
Please read the FAQ at 
http://www.tux.org/lkml/