Date: Mon, 4 Jan 1999 17:14:24 MET-1
From: "Petr Vandrovec Ing. VTEI" <>
Subject: Re: ncpfs slist network smash (olitr bug?)
Sender: linux-kernel-owner@vger.kernel.org
Precedence: bulk
List-ID: <linux-kernel.vger.kernel.org>
X-Mailing-List: linux-kernel@vger.kernel.org
X-Lkml-Link: https://lkml.org/lkml/1999/1/5/89

> I will have to wait to go back into work to try ibmtr; I have the card but
> I have to physically plug it into the network.
>
> However, I did try the "strace slist 2> out" test, since I could do that
> remotely.
>
> With kernel 2.0.36, my output file was 490 lines long (mostly select() and
> recv()'s). With 2.2.0-pre2, the slist completed instead of hanging (perhaps
> because there's less network traffic at work at midnight), but my slist
> output is 1946 lines long, again select()'s and recv()'s.
> These two tests were done back-to-back, so there should be no traffic
> change on the network.
> `tail -20 output-2.0.36`
It is ok.
> send(3, "\"\"J\31\1\0\27\0\t7g\22\0\32\0\4"..., 18, 0) = 18
send request
> select(4, [3], [], [], {3, 0})          = 1 (in [3], left {3, 0})
> recv(3, "33J\31\1\0\374\0", 8, 0x2)     = 8
and peek into reply...
> select(4, [3], [], [], {1, 0})          = 1 (in [3], left {1, 0})
> recv(3, "33J\31\1\0\374\0", 4070, 0)    = 8
and remove it from queue
but
> `tail -20 output-2.2.0-pre2`
> send(3, "UUK\4\1\0\0", 7, 0)            = 7
send request to terminate connection (NCP verb 0x5555, seq. 4Bh, connection 4)
> select(4, [3], [], [], {3, 0})          = 1 (in [3], left {2, 990000})
> recv(3, "33J\4\1\0\374\0", 8, 0x2)      = 8
receive PREVIOUS reply (sequence number 'J' instead of 'K')
> select(4, [3], [], [], {1, 0})          = 1 (in [3], left {1, 0})
> recv(3, "33J\4\1\0\374\0", 8, 0)        = 8
and throw it away
> select(4, [3], [], [], {3, 0})          = 1 (in [3], left {2, 990000})
> recv(3, "33J\4\1\0\374\0", 8, 0x2)      = 8
and again duplicate
> select(4, [3], [], [], {1, 0})          = 1 (in [3], left {1, 0})
> recv(3, "33J\4\1\0\374\0", 8, 0)        = 8
throw it away
> select(4, [3], [], [], {3, 0})          = 1 (in [3], left {3, 0})
> recv(3, "33K\4\1\0\0\0", 8, 0x2)        = 8
that's right
> select(4, [3], [], [], {1, 0})          = 1 (in [3], left {1, 0})
> recv(3, "33K\4\1\0\0\0", 4070, 0)       = 8
fetch it and end.
> close(3)                                = 0
> close(4)                                = 0
End...
> Just to remind other readers on what's happening, my 2.2.0-pre2 machine
> spews NCP (IPX) packets at an incredible rate (at least 3K packets/sec)
> when using 'slist' with the Olicom TR driver. I don't know who is the
> culprit yet. 2.0.36 behaves. Unfortunately, I had not tried any 2.1.x
> kernels.
It looks like that your driver duplicates requests or replies - it is not
clear for dump, but there were probably one reply and two (unneeded and
unexpected) duplicates received.
                                        Best regards,
                                                Petr Vandrovec
                                                vandrove@vc.cvut.cz
-
To unsubscribe from this list: send the line "unsubscribe linux-kernel" in
the body of a message to majordomo@vger.rutgers.edu
Please read the FAQ at 
http://www.tux.org/lkml/